Список тестов
Проект Банк
1) Идентификация пользователя
1.1) Регистрация
1.2) Авторизация
1.3) Выход из учетной записи пользователя
2) Работа с функциями банка
2.1) Сокрытие данных карты
2.2) Интерфейс банка
2.2.1) Проверка наличия всех элементов на главной странице
2.2.2) Проверка переключения между разделами
3) Разделы Банка
3.1) Кредиты
3.2) Переводы
3.3) Транзакции
3.4) API
3.5) Обзор
3.6) Быстрый перевод
4) Работа с REST API + БД
4.1) Подключение необходимых библиотек.
4.2) Прогон запросов, отображенных в документации Swagger
4.3) Работа с БД ( PosgreSQL)

Далее дополнить проект на селениде